
# Libraries
brew "nettle"
brew "jpeg"
brew "openssl"
brew "readline"
brew "isl"

# GNU utils
brew "gnutls"
brew "coreutils"
brew "binutils"
brew "findutils", args: ["with-default-names"]
brew "diffutils"
brew "gawk"
brew "gnu-sed", args: ["with-default-names"]
brew "gnu-tar", args: ["with-default-names"]
brew "gnu-which", args: ["with-default-names"]
brew "grep", args: ["with-default-names"]
brew "watch"

# Language and vcs
brew "git"
brew "python"
brew "python3"
brew "go"

# Shell utilities
brew "zsh"
brew "fzf"
brew "tmux"
brew "uptimed"
brew "neovim"
brew "tldr"
brew "httpie"
brew "jq"
brew "openvpn"
brew "mpv"
brew "htop"
brew "xz"
brew "reattach-to-user-namespace"
brew "asciinema"
brew "highlight"
brew "openvpn"
brew "ag"
brew "openssh"
brew "hugo"
brew "kubectx"

# Network utilities
brew "knot-resolver" # proxy to run dns over tls (more info: https://phiffer.org/writing/dns-over-tls-on-macos/)
